Revit 2027 API
CableTraySizes.GetSizeCount Method
 Gets the size count of the cable tray size table.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSizeCount()
Public Function GetSizeCount As Integer
public:
int GetSizeCount()
member GetSizeCount : unit -> int
Return Value
Int32
See Also
Reference
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace